#ifndef CALCULATOR_H
#define CALCULATOR_H

class Calculator
{
    public:

        int Add (int, int);
        int Mul (double, double);
};

#endif//CALCULATOR_H

// Ло́жный ва́куум — состояние в квантовой теории поля, которое не является состоянием с глобально минимальной энергией, а соответствует её локальному минимуму. Такое // состояние стабильно в течение определённого времени (метастабильно), но может «туннелировать» в состояние истинного вакуума.
//
// В одной из гипотез «раздувающейся Вселенной» из ложного вакуума вскоре после появления Вселенной могла образоваться не одна, а множество метагалактик (в том числе и //наша)[1], в таком случае Большой взрыв — переход ложного вакуума в обычный[2].
//
// Оценка времени жизни метастабильного вакуума в Стандартной модели для наблюдаемой Вселенной лежит в диапазоне от 1058 до 10241 лет ввиду неопределённостей в параметрах //частиц, главным образом в массах топ-кварка и бозона Хиггса[3]